poiuy105/uart0to1/sdkconfig.defaults
# 彻底禁用 console，完全释放 UART0 用于数据转发
CONFIG_ESP_CONSOLE_NONE=y

# ESP32-C3 目标芯片
CONFIG_IDF_TARGET="esp32c3"
